## Learning Objectives:


1. Selection via indexing
2. Row indexing
3. Column Selection
4. .loc[ ] method in dataframes
5. Slicing in loc method
6. iloc[ ] method for indexing

In [1]:
import numpy as np
import pandas as pd

In [2]:
##creating a dataframe using dictionary
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Rahul"],
               "Age": np.random.randint(20, 25, size=5),
               "Sub1_Score": np.random.randint(40, 100, size=5),
               "Sub2_Score": np.random.randint(40, 100, size=5),
               "Sub3_Score": np.random.randint(40, 100, size=5)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   22          40          65          99
1   Katey   24          88          54          59
2     Mak   23          47          70          91
3    Bill   24          91          84          86
4   Rahul   22          64          73          57

In [3]:
scores_df[2]

KeyError: 2

In [4]:
scores_df['Student']

0      Tom
1    Katey
2      Mak
3     Bill
4    Rahul
Name: Student, dtype: object

In [5]:
scores_df[:]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   22          40          65          99
1   Katey   24          88          54          59
2     Mak   23          47          70          91
3    Bill   24          91          84          86
4   Rahul   22          64          73          57

In [6]:
scores_df[1:4]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
1   Katey   24          88          54          59
2     Mak   23          47          70          91
3    Bill   24          91          84          86

In [7]:
scores_df[2:3]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
2     Mak   23          47          70          91

## Column selection

In [8]:
scores_df[['Sub1_Score', 'Sub2_Score']]

   Sub1_Score  Sub2_Score
0          40          65
1          88          54
2          47          70
3          91          84
4          64          73

## `.loc[ ]` method in dataframes

In [9]:
scores_df = scores_df.set_index('Student')
scores_df

         Age  Sub1_Score  Sub2_Score  Sub3_Score
Student
Tom       22          40          65          99
Katey     24          88          54          59
Mak       23          47          70          91
Bill      24          91          84          86
Rahul     22          64          73          57

In [10]:
scores_df.loc['Tom']

Age           22
Sub1_Score    40
Sub2_Score    65
Sub3_Score    99
Name: Tom, dtype: int64

In [11]:
scores_df.loc[['Tom', 'Katey']]

         Age  Sub1_Score  Sub2_Score  Sub3_Score
Student
Tom       22          40          65          99
Katey     24          88          54          59

In [13]:
scores_df.loc[['Tom', 'Katey'], ['Sub1_Score', 'Sub3_Score']]

         Sub1_Score  Sub3_Score
Student
Tom              40          99
Katey            88          59

In [14]:
scores_df.loc['Katey': 'Bill']

         Age  Sub1_Score  Sub2_Score  Sub3_Score
Student
Katey     24          88          54          59
Mak       23          47          70          91
Bill      24          91          84          86

## `iloc[ ]` method in dataframe

In [15]:
scores_df = scores_df.reset_index(drop=True)
scores_df

   Age  Sub1_Score  Sub2_Score  Sub3_Score
0   22          40          65          99
1   24          88          54          59
2   23          47          70          91
3   24          91          84          86
4   22          64          73          57

In [16]:
scores_df[1:4:2]

   Age  Sub1_Score  Sub2_Score  Sub3_Score
1   24          88          54          59
3   24          91          84          86

In [17]:
scores_df[::-1]

   Age  Sub1_Score  Sub2_Score  Sub3_Score
4   22          64          73          57
3   24          91          84          86
2   23          47          70          91
1   24          88          54          59
0   22          40          65          99

In [18]:
scores_df.iloc[2]

Age           23
Sub1_Score    47
Sub2_Score    70
Sub3_Score    91
Name: 2, dtype: int64

In [19]:
scores_df.iloc[1:3]

   Age  Sub1_Score  Sub2_Score  Sub3_Score
1   24          88          54          59
2   23          47          70          91

In [20]:
scores_df.iloc[:, 1:]

   Sub1_Score  Sub2_Score  Sub3_Score
0          40          65          99
1          88          54          59
2          47          70          91
3          91          84          86
4          64          73          57

In [23]:
scores_df.iloc[::2, 2:]

   Sub2_Score  Sub3_Score
0          65          99
2          70          91
4          73          57